{"basics":{"name":"Kenneth Tiet","label":"Software Engineer","image":"","email":"tietkenneth@gmail.com","phone":"(626)400-9263","url":"https://kennethtiet.github.io","summary":"Specialist at Apple. Previously researcher at the USC Haptics Robotics and Virtual Interaction Lab. Recent graduate from the University of Southern California with a Bachelors of Science in Computer Science.","location":{"address":"","postalCode":"","city":"Los Angeles","countryCode":"US","region":"California"},"profiles":[{"network":"","username":"","url":""}]},"work":[{"name":"Specialist at Apple","position":"Specialist","url":"https://apple.com","startDate":"Oct 2024","endDate":"Present","Summary":"Enriching lives through personal connections and delivering tailored technical solutions!","highlights":["Provided 50+ personalized technical recommendations weekly and guided seamless technical setups","Conducted in-depth analysis for 10+ customers daily, leveraging technical knowledge to provide tailored solutions","Led 15+ product demonstrations monthly, showcasing Apple Vision Pro and iOS software features","Enhanced team skills by collaborating with a team of 20+ colleagues and interacting with 100+ customers monthly"]},{"name":"Haptics Robotics and Virtual Interaction Lab, University of Southern California","position":"Backend Software Engineer","url":"https://sites.usc.edu/culbertson/","startDate":"Jun 2023","endDate":"Jun 2024","summary":"Contributed to audit management tool for research settings!","highlights":["Enabled file uploads by implementing core functions of web application using React, TypeScript, and JavaScript","Improved onboarding and codebase maintainability by creating clear documentation using Markdown","Completed prototype with a 6 person cross functional team using Agile Scrum, presented it at SoCal Robotics 2023","Converted JavaScript codebase to TypeScript by refactoring existing modules and adding type definitions","Reduced technical debt by removing hard-coding and refactoring code, improving reliability and maintainability"]},{"name":"Institute of Arts, Music & Science","position":"Robotics Instructor","url":"http://www.iams-usa.org/","startDate":"Feb 2024","endDate":"Oct 2024","summary":"Taught robotics and programming through project led instruction!","highlights":["Provided robotics education to 3+ elementary students using Lego Mindstorms and project based approach","Assisted students in programming 6+ robots by providing elementary programming instruction","Ensured a safe and clean learning environment with daily cleaning and organizing of classroom"]},{"name":"RoviSys","position":"Software Intern","url":"http://www.rovisys.com","startDate":"May 2022","endDate":"Aug 2022","summary":"Automated processes with software at RoviSys!","highlights":["Developed 5 software tools that automated company processes, resulting in annual cost savings of $300,000","Wrote comprehensive documentation for 5 software tools, simplifying user adoption and improving maintability"]}],"education":[{"institution":"University of Southern California","location":"Los Angeles, California","url":"https://www.usc.edu","area":"Computer Science","studyType":"Bachelors of Science","startDate":"2020","endDate":"2023","score":"10","courses":["GPA: 3.6","Course work: Software Engineering, Data Structures, Algorithms, Computer Systems, Operating Systems, Networking"]}],"awards":[{"title":"Pasadena City College Dean's Honors x 4","date":"2018-2019","awarder":"Pasadena City College","url":"https://pasadena.edu/","summary":"Dean's Honors includes all students whose semester grade-point average is 3.500 or higher, with A, B, or C grades in 12 or more units of courses"},{"title":"Pasadena City College Scholar-Athlete x 2","date":"2018-2020","awarder":"Pasadena City College","url":"https://pcclancers.com/general/Scholar_Baller","summary":"Pasadena City College Athletics continues to honor student-athletes with a 3.0 GPA or better."}],"skills":[{"name":"Languages","level":"Intermediate","icon":"fa-solid fa-hashtag","keywords":["Python","C++","JavaScript","TypeScript","Java","SQL","HTML","CSS"]},{"name":"Frameworks","level":"","icon":"fa-solid fa-hashtag","keywords":["React","Bootstrap","Node.js","Express.js","Serverless Framework"]},{"name":"Developer Tools","level":"","icon":"fa-solid fa-hashtag","keywords":["Amazon Web Services (AWS)","Github","Visual Studio Code","Docker","Jira","Postman"]},{"name":"Database","level":"","icon":"fa-solid fa-hashtag","keywords":["PostgreSQL","AWS DynamoDB","MySQL","Google Firebase"]}],"languages":[{"language":"English","fluency":"Native","icon":""},{"language":"Mandarin","fluency":"Elementary","icon":""}],"projects":[{"name":"NoteIt","summary":"Productivity tool with functional features for note organization and retrieval.","highlights":["Tech Stack: Python, Django, React, PostgreSQL","Minimized code-base by approx. 25% by implementing RESTful APIs from the Django REST Framework","Enabled storage of notes up to 8 GB on an online database, using PostgreSQL and Digital Ocean"],"startDate":"Jun 2024","endDate":"July 2024"},{"name":"TicTacToe","summary":"Classic tic-tac-toe game built in React","highlights":["Tech Stack: React","Programmed game using React and JavaScript complete with Time-travel and history of moves","Utilized a modular design approach, creating reusable components such as Board, Square, and Game"],"startDate":"May 2024","endDate":"May 2024"},{"name":"Network Simulation","summary":"Built networking of communicating servers to develop expertise in networking fundamentals","highlights":["Tech Stack: C++","Mastered TCP/IP and UDP protocols, resulting in a 95% accuracy rate in simulated data transmission","Reduced latency by approximately 20% by implementing efficient socket management techniques"],"startDate":"May 2024","endDate":"May 2024"},{"name":"SuperChat","summary":"Real time instant messaging application that allows users to communicate in a global chat room","highlights":["Tech Stack: React, Firebase","Reduced sign-in time by 66% and code-base by 20% using Google Sign-In and Firebase authentication","Improved message latency by 30% by utilizing cloud syncing feature from Firebase Realtime Database"],"startDate":"Jun 2023","endDate":"Aug 2023"},{"name":"EventMe","summary":"Event registration Android mobile app that allows users to view and register for local events","highlights":["Tech Stack: Android, Java, Google Firebase, JUnit, Espresso","Mitigated frequency of callbacks by 20% by redesigning database schema and restructuring database queries","Diminished back-end errors by 40% and increased error visibility by implementing robust testing & error handling"],"startDate":"Sep 2022","endDate":"Nov 2022"},{"name":"Bankify","summary":"Mock banking application that provides financial services for over 50+ users and fulfulled over 40,000+ requests","highlights":["Tech Stack: Linux, Apache, MySQL, Perl","Decreased data access times by 35% by designing an effective database schema and restructuring queries","Protected against 100+ brute force and rainbow table attacks, using salt-hashing password protection method"],"startDate":"Sep 2022","endDate":"Nov 2022"},{"name":"LinkBucket","summary":"Full stack link-sharing social platform","highlights":["Tech Stack: Java, HTML, CSS, MySQL","Maintained a 99% success rate with user authentication and login authorization from robust implementation","Improved data retrieval by 25% by redesigning database schemas to more effectively handle user data"],"startDate":"Feb 2022","endDate":"Mar 2022"}]}